[
  [
    "1. Saudi Aramco, Saudi Arabia",
    "2. Chevron, US",
    "3. Gazprom, Russia",
    "4. ExxonMobil, US",
    "5. National Iranian Oil Co",
    "6. BP, UK",
    "7. Royal Dutch Shell, Netherlands",
    "8. Coal India, India",
    "9. Pemex, Mexico",
    "10. Petróleos de Venezuela (PDVSA)",
    "11. PetroChina",
    "12. Peabody Energy, US",
    "13. ConocoPhillips, US",
    "14. Abu Dhabi National Oil Company",
    "15. Kuwait Petroleum Corporation, Kuwait",
    "16. Iraq National Oil Co, Iraq",
    "17. Total SA, France",
    "18. Sonatrach, Algeria",
    "19. BHP Billiton, Australia",
    "20. Petrobras, Brazil"
  ],
  [
    "13.6m barrels of oil equivalent a day",
    "2.93m barrels of oil equivalent a day",
    "9.7m barrels of oil equivalent a day",
    "3.7m barrels of oil equivalent a day",
    "4m barrels of oil equivalent a day",
    "2.35m barrels of oil equivalent a day",
    "3.6m barrels of oil equivalent a day in 2018",
    "600m tonnes of coal in 2018-19 financial year",
    "2.5m barrels of oil equivalent a day",
    "1.6m barrels of oil equivalent a day",
    "4.1m barrels of oil equivalent a day",
    "509,589 tons (about 460,000 tonnes) in 2018 a day",
    "1.2m barrels of oil equivalent a day",
    "2.1m barrels of oil equivalent a day",
    "2.7m barrels of oil equivalent a day",
    "1.5m barrels of oil equivalent a day",
    "2.3m barrels of oil equivalent a day",
    "2.4m barrels of oil equivalent a day",
    "331,505 barrels of oil equivalent; 189,041 tonnes of coal (thermal and metallurgical) a day",
    "2.6m barrels of oil equivalent a day"
  ],
  [
    "59,262m tonnes of CO2, 4.38% of global total",
    "43,345m tonnes of CO2, 3.2% of global total",
    "43,230m tonnes of CO2, 3.19% of global total",
    "41,904m tonnes of CO2, 3.09% of global total",
    "35,658m tonnes of CO2 2.63% of global total",
    "34,015m tonnes of CO2, 2.51% of global total",
    "31,948m tonnes of CO2, 2.36% of global total",
    "23,124m tonnes of CO2, 1.71% of global total",
    "22,645m tonnes of CO2, 1.67% of global total",
    "15,745m tonnes of CO2, 1.16% of global total",
    "15,632m tonnes of CO2, 1.15% of global total",
    "15,385m tonnes of CO2, 1.14% of global total",
    "15,229m tonnes of CO2, 1.12% of global total",
    "13,840m tonnes of CO2 (and methane converted to CO2), 1.01% of global total",
    "13,479m tonnes of CO2 (and methane converted to CO2), 1% of global total",
    "12,596m tonnes of CO2 equivalent, 0.93% of global total",
    "12,352m tonnes of CO2 equivalent, 0.91% of global total",
    "12,302m tonnes of CO2, 0.91% of global total",
    "9,802m tonnes of CO2 equivalent, 0.72% of global total",
    "8,676m tonnes of CO2, 0.64% of global total."
  ],
  [
    "27,035m tonnes of CO2",
    "7,288m tonnes of CO2",
    "18,381m tonnes of CO2",
    "10,446m tonnes of CO2",
    "15,132m tonnes of CO2",
    "7,634m tonnes of CO2",
    "9,403m tonnes of CO2",
    "n/a",
    "3,577m tonnes of CO2",
    "2,505m tonnes of CO2",
    "8,985m tonnes of CO2",
    "n/a",
    "3,094m tonnes of CO2",
    "6,224m tonnes of CO2",
    "6,897m tonnes of CO2",
    "n/a",
    "5,830m tonnes of CO2",
    "3,637m tonnes of CO2",
    "n/a",
    "5,427m tonnes of CO2"
  ],
  [
    "$18bn investment in extending Marjan and Berri oilfields off the eastern coast of Saudi Arabia to extract another 550,000 barrels per day",
    "Has a $20bn plan to expand drilling during 2019, including in the Tengiz oilfield in Kazakhstan and the Permian basin in Texas",
    "The Yamal megaproject is a long-term plan to \"exploit and bring to the markets\" the vast natural gas reserves in the Yamal Peninsula in Siberia. Gazprom says the centre will eventually produce up to 360bn cubic metres of gas a year",
    "Exxon has a goal of boosting its annual earnings potential by more than 140% by 2025 via a glut of major projects in Texas, Guyana, Brazil, Mozambique and Papua New Guinea. These projects are expected to increase Exxon's production to around five million oil equivalent barrels a day by 2025",
    "Huge expansion planned in the coming 10 years that would make this the world's biggest oil and gas company, although oil production is reportedly at the lowest level since the 1980s as a result of US sanctions ",
    "The Mad Dog Phase 2 project – in which BP will work alongside BHP and Chevron in 4,500ft of water in the Gulf of Mexico – has the capacity to produce up to 140,000 gross barrels of crude oil per day from 14 production wells. The Mad Dog area is estimated to hold 4bn barrels of oil equivalent.",
    "A plan for massive oil and gas fracking in Sierras Blancas, Neuquén, Argentina, of up to 70,000 barrels of oil equivalent per day by the mid-2020s",
    "Magadh expansion, Karo",
    "The company says it will focus on shallow water projects rather than costly and technologically complex deepwater projects in the Gulf of Mexico in the coming years",
    "Oil reserves in Venezuela are the biggest in the world, but US sanctions and political chaos mean production has slumped nearly 80% since 2012",
    "The vast Tarim oil and gas field in the far western region of Xinjiang is being expanded to 565,000 barrels a day",
    "Recently announced a joint venture with Arch Coal to combine operations in Colorado and in the Powder River Basin, which stretches across Montana and Wyoming, so coal can better compete with natural gas and renewables",
    "Escalated drilling operations in the North Sea, as well as in Canada and Alaska",
    "Expansion of polypropylene plants – the key product in the making of single-use plastics such as clingfilm and margarine pots – to increase production by 11% to reach 5m tonnes per year",
    "It has announced plans for energy projects of $500bn over the next 20 years, to increase oil production to 4.75m barrels a day",
    "There are huge oil reserves in Iraq and the INOC says there are also four gas projects on the table including al-Halfaya, which is expected to produce 300m cubic metres per day. Basra gas projects are also growing",
    "Alongside its fellow fossil fuel giant Exxon, Total SA is planning a $10bn expansion into Papua New Guinea that is set to double the impoverished country's export of liquid natural gas",
    "Already Africa's biggest company, Sonatrach is planning to become a player in the global plastic industry by building a huge new polypropylene plant in Algeria. Sonatrach is also responsible for solar power in Algeria, which the government wants to develop so it can export more oil",
    "The untapped Trion oil project in the Gulf of Mexico could yield more than 485m barrels of oil equivalent. BHP bought a 60% share in 2016 and operates the project",
    "Preparing for the world's biggest expansion of offshore oil and gas production by putting out tenders for seven huge floating production, storage and offloading (FPSO) vessels"
  ],
  [
    "n/a",
    "Blamed for polluting activities in the Ecuadorian Amazon, although an international tribunal has said it is not liable for damages. Also blamed for oil spills in Angola and Brazil",
    "The capture and imprisonment of 30 Greenpeace environmental campaigners who tried to occupy a Gazprom drilling platform in the Arctic drew worldwide condemnation",
    "In March 1989 the Exxon Valdez, an oil tanker owned by the Exxon Shipping Company, struck a reef off the Alaska coast. About 37,000 tonnes of oil was spilled into the sea within a few days, befouling more than 1,000 miles of coastline in a remote, relatively untouched area. It remains one of the worst environmental disasters caused by humans",
    "The collision of the Iranian tanker Sanchi in January 2018 was the worst oil ship disaster in decades. All 32 crew died and three oil slicks spread over 332 sq km (128 sq miles), raising fears of seafood contamination",
    "The Deepwater Horizon oil spill in the Gulf of Mexico in April 2010 was the largest in history. A BP drilling rig exploded, killing 11 workers and spewing about 4m barrels of oil into the Gulf. Experts say it had a devastating environmental impact that altered the basic building blocks of life in the ocean",
    "In May 2016 an estimated 2,100 barrels of oil, nearly 90,000 gallons, spilled into the Gulf of Mexico – leaked from an undersea pipeline system operated off the Louisiana coast",
    "n/a",
    "Bribery and tax fraud charges were filed earlier this year against the former head of the state-run oil company, who is accused of receiving bribes in connection with the oil company's purchase of a fertiliser plant",
    "An explosion at Paraguaná, Venezuela's biggest oil refinery, in 2012 killed 42 people, damaged 1,600 homes and sent plumes of carbon dioxide and toxic chemicals into the sky",
    "In 2003, a toxic gas leak in Chongqing killed 242 people. In 2005, an explosion at a plant in Jilin killed six and polluted the Songhua River so badly that 4 million people in Harbin had their taps cut off. In 2010, a pipeline explosion in Dalian discharged 1,500 tonnes of crude oil into the Yellow Sea. The company says it has in place strong environmental protection safeguards",
    "Accused of polluting water supplies on Native American land. The New York attorney general concluded in 2015 it had misled investors on climate change – a settlement followed",
    "Fined by authorities in the US and China over oil spills. In 2005 it agreed to spend more than half a billion dollars to remedy clean air violations in the US",
    "n/a",
    "n/a",
    "n/a",
    "Total SA was found to be responsible for the 1999 sinking of the tanker Erika in the Bay of Biscay when 20,000 tonnes of toxic fuel oil polluted the sea, devastating 250 miles (400km) of beaches and shoreline, crippling local industries and killings tens of thousands of seabirds",
    "In July, the company suffered its worst accident in 15 years when a huge liquefied natural gas complex exploded. Smoke billowed into the sky for two days until firefighters extinguished the blaze",
    "The 2016 collapse of a tailings dam in Brazil killed 19 people, destroyed villages, left hundreds homeless and killed fish and other aquatic life in the Gualaxo do Norte River",
    "Oil spills of over a million litres into Guanabara Bay in Rio de Janeiro in 1975 and 2000. Many others since, including two this year of hundreds of thousands of litres from offshore platforms and ships"
  ],
  [
    "Dhahran, Saudi Arabia",
    "San Ramon, California, US",
    "Moscow, Russia",
    "Irving, Texas, US",
    "Tehran, Iran",
    "London, UK",
    "The Hague, Netherlands",
    "Kolkata, India",
    "Mexico City, Mexico",
    "Caracas, Venezuela",
    "Beijing, China",
    "St Louis, Missouri, US",
    "Houston, Texas, US",
    "Abu Dhabi, UAE",
    "Kuwait City, Kuwait",
    "Baghdad, Iraq",
    "Courbevoie, France",
    "Algiers, Algeria",
    "Melbourne, Australia, and London, UK",
    "Rio de Janeiro, Brazil"
  ]
]
